bivex/ArchC/tests/nrf52/nrf52_arch.H
/******************************************************
 * ArchC Resources header file.                       *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef  NRF52_ARCH_H
#define  NRF52_ARCH_H

#include  "nrf52_parms.H"
#include  "ac_arch_dec_if.H"
#include  "ac_mem.H"
#include  "ac_memport.H"
#include  "ac_regbank.H"
#include  "ac_reg.H"
 
//!ArchC class for model-specific architectural resources.

class nrf52_arch : public ac_arch_dec_if<nrf52_parms::ac_word, nrf52_parms::ac_Hword> {
public:

  //!Program Counter.
  ac_reg<unsigned> ac_pc;

  //!Processor id.
  ac_reg<unsigned> ac_id;

  //!Storage Devices.
  ac_mem DM;
  ac_memport<nrf52_parms::ac_word, nrf52_parms::ac_Hword> DM_mport;
  ac_mem FLASH;
  ac_memport<nrf52_parms::ac_word, nrf52_parms::ac_Hword> FLASH_mport;
  ac_mem SRAM;
  ac_memport<nrf52_parms::ac_word, nrf52_parms::ac_Hword> SRAM_mport;
  ac_mem RADIO_PERIPH;
  ac_memport<nrf52_parms::ac_word, nrf52_parms::ac_Hword> RADIO_PERIPH_mport;
  ac_regbank<16, nrf52_parms::ac_word, nrf52_parms::ac_Dword> R;
  ac_reg<nrf52_parms::ac_word> xpsr;
  ac_reg<nrf52_parms::ac_word> primask;
  ac_reg<nrf52_parms::ac_word> control;
  ac_reg<nrf52_parms::ac_word> event_reg;


  //!Constructor.
  explicit nrf52_arch();

  //!Module initialization method.
  virtual void init(int ac, char* av[]) = 0;

  //!Module finalization method.
  virtual void stop(int status = 0) = 0;

  //!Virtual destructor declaration.
  virtual ~nrf52_arch() {};

  static int globalId;
  int getId() { return ac_id.read(); }
};

#endif  //_NRF52_ARCH_H
